Revit 2026 API
Document.NewLineBoundaryConditions Method
 Creates a new Line BoundaryConditions element.
Overload List
Name | Description
NewLineBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new Line BoundaryConditions element on a host element.
NewLineBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new Line BoundaryConditions element on a reference.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace